Revit 2024 API
ScheduleFilter.SetValue Method
Overload List
Name | Description
SetValue(Double)
 Set the filter value to a double.
SetValue(Int32)
 Set the filter value to an integer.
SetValue(String)
 Set the filter value to a string.
SetValue(ElementId)
 Set the filter value to an ElementId.
See Also
ScheduleFilter Class
ScheduleFilter Members
Autodesk.Revit.DB Namespace